sercankuslu/astromonty/trunk/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
    static DWORD t = 0;
   	static DWORD d = 0;
    static DWORD dwLastIP = 0;

    //volatile DWORD UTCT;
    LATFbits.LATF4 = 0;
    TRISFbits.TRISF4 = 0;	
    
    TRISBbits.TRISB4 = 0;
        
    // Initialize application specific hardware
    // Для работы A13  его нужно отключить от ADC
    {
        TRISAbits.TRISA12 = 1;
        AD1CON1 = 0;
        AD2CON1 = 0;
        AD1PCFGH = 0xFFFF;
        AD1PCFGL = 0xFFFF;
        AD2PCFGL = 0xFFFF;
    }
		
	//BYTE res;
	//char bfr[64];
    //BYTE length=0;
    //AppConfig.MyIPAddr.Val = 0x12345678;
	//while(1){
	//	res = RunClient(bfr, sizeof(bfr), &length);		
	//	res = ProcessClients(0, bfr, &length);			
	//}

    
	//while(1){
	//	Nop();
	//}
    
    InitializeBoard();
    // calculate CPU speed  
    {
	    T6CON = 0x0002;
	    T8CON = 0x0008;
	    T9CON = 0x0000;
	    PR8=0xFFFF;
	    PR9=0xFFFF;
	    TMR6 = 0x7FFF;
	    TMR8 = 0x0000;
	    TMR9 = 0x0000;	
	    CPUSPEED.Val = 0;
	    IFS2bits.T6IF = 0;
	    IEC2bits.T6IE = 1;
	    IPC11bits.T6IP = 7;
	    T6CONbits.TON = 1;
	    T8CONbits.TON = 1;	
    }
     
    /*	
	while(1){
		Nop();
	}
    */
	
#if defined(USE_LCD)
    // Initialize and display the stack version on the LCD
    LCDInit();
    DelayMs(100);
    strcpypgm2ram((char*)LCDText, "TCPStack " TCPIP_STACK_VERSION "  "
	    "                ");
    LCDUpdate();
#endif

    // Initialize stack-related hardware components that may be 
    // required by the UART configuration routines
    TickInit();
#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
    MPFSInit();
#endif

    // Initialize Stack and application related NV variables into AppConfig.
    InitAppConfig();

    // Initiates board setup process if button is depressed 
    // on startup
    #ifdef bad
    if(BUTTON0_IO == 0u)
    {
	#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
	// Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
	DWORD StartTime = TickGet();
	LED_PUT(0x00);
			
	while(BUTTON0_IO == 0u)
	{
	    if(TickGet() - StartTime > 4*TICK_SECOND)
	    {
		    #if defined(EEPROM_CS_TRIS)
	        XEEBeginWrite(0x0000);
	        XEEWrite(0xFF);
	        XEEWrite(0xFF);
	        XEEEndWrite();
	        #elif defined(SPIFLASH_CS_TRIS)
	        SPIFlashBeginWrite(0x0000);
	        SPIFlashWrite(0xFF);
	        SPIFlashWrite(0xFF);
	        #endif
    	    
	        #if defined(STACK_USE_UART)
	        putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
	        #endif

	        LED_PUT(0x0F);
	        while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
	        LED_PUT(0x00);
	        while(BUTTON0_IO == 0u);
	        Reset();
	        break;
	    }
	}
	#endif

	#if defined(STACK_USE_UART)
        DoUARTConfig();
	#endif
    }
    #endif //bad
    // Initialize core stack layers (MAC, ARP, TCP, UDP) and
    // application modules (HTTP, SNMP, etc.)
    StackInit();

    #if defined(WF_CS_TRIS)
    WF_Connect();
    #endif

    // Initialize any application-specific modules or functions/
    // For this demo application, this only includes the
    // UART 2 TCP Bridge
    #if defined(STACK_USE_UART2TCP_BRIDGE)
    UART2TCPBridgeInit();
    #endif

    #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
    ZeroconfLLInitialize();
    #endif

    #if defined(STACK_USE_ZEROCONF_MDNS_SD)
    mDNSInitialize(MY_DEFAULT_HOST_NAME);
    mDNSServiceRegister(
        (const char *) "DemoWebServer",	// base name of the service
        "_http._tcp.local",			    // type of the service
        80,				                // TCP or UDP port, at which this service is available
        ((const BYTE *)"path=/index.htm"),	// TXT info
        1,								    // auto rename the service when if needed
        NULL,							    // no callback function
        NULL							    // no application context
        );

    mDNSMulticastFilterRegister();			
	#endif

	
 	
	OCInit();

    // Now that all items are initialized, begin the co-operative
    // multitasking loop.  This infinite loop will continuously 
    // execute all stack-related tasks, as well as your own
    // application's functions.  Custom functions should be added
    // at the end of this loop.
    // Note that this is a "co-operative mult-tasking" mechanism
    // where every task performs its tasks (whether all in one shot
    // or part of it) and returns so that other tasks can do their
    // job.
    // If a task needs very long time to do its job, it must be broken
    // down into smaller pieces so that other tasks can have CPU time.
    while(1)
    {
        // Blink LED0 (right most one) every second.
        
        //if(TickGet() - d >= TICK_SECOND/16000ul)
        //{
        //    d = TickGet();
        //   	LATDbits.LATD0 ^= 1; // выход STEP
            
        //}
		if(TickGet() - d >= TICK_SECOND/16){
			d = TickGet();
			LATBbits.LATB4 ^=1;
		}
		
		if(PORTAbits.RA13 != t){
		    t = PORTAbits.RA13;
	            LED0_IO ^= 1;
	            AdjustLocalRTCTime();            
		}
        // This task performs normal stack task including checking
        // for incoming packet, type of packet and calling
        // appropriate stack entity to process it.
        StackTask();

        // This tasks invokes each of the core stack application tasks
        StackApplications();

        #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
		ZeroconfLLProcess();
        #endif

        #if defined(STACK_USE_ZEROCONF_MDNS_SD)
        mDNSProcess();
	// Use this function to exercise service update function
	// HTTPUpdateRecord();
        #endif

	// Process application specific tasks here.
	// For this demo app, this will include the Generic TCP 
	// client and servers, and the SNMP, Ping, and SNMP Trap
	// demos.  Following that, we will process any IO from
	// the inputs on the board itself.
	// Any custom modules or processing you need to do should
	// go here.
	#if defined(STACK_USE_GENERIC_TCP_CLIENT_EXAMPLE)
	GenericTCPClient();
	#endif
	
	#if defined(STACK_USE_GENERIC_TCP_SERVER_EXAMPLE)
	GenericTCPServer();
	#endif
	
	#if defined(STACK_USE_SMTP_CLIENT)
	SMTPDemo();
	#endif
	
	#if defined(STACK_USE_ICMP_CLIENT)
	PingDemo();
	#endif
	
	#if defined(STACK_USE_SNMP_SERVER) && !defined(SNMP_TRAP_DISABLED)
	//User should use one of the following SNMP demo
	// This routine demonstrates V1 or V2 trap formats with one variable binding.
	SNMPTrapDemo();
	
	#if defined(SNMP_STACK_USE_V2_TRAP) || defined(SNMP_V1_V2_TRAP_WITH_SNMPV3)
	//This routine provides V2 format notifications with multiple (3) variable bindings
	//User should modify this routine to send v2 trap format notifications with the required varbinds.
	//SNMPV2TrapDemo();
	#endif 
	if(gSendTrapFlag)
	    SNMPSendTrap();
	#endif
	
	#if defined(STACK_USE_BERKELEY_API)
	//BerkeleyTCPClientDemo();
	    BerkeleyTCPServerDemo();
	//BerkeleyUDPClientDemo();
	#endif

	ProcessIO();

        // If the local IP address has changed (ex: due to DHCP lease change)
        // write the new IP address to the LCD display, UART, and Announce 
        // service
	if(dwLastIP != AppConfig.MyIPAddr.Val)
	{
	    dwLastIP = AppConfig.MyIPAddr.Val;
			
	    #if defined(STACK_USE_UART)
		    putrsUART((ROM char*)"\r\nNew IP Address: ");
	    #endif

